Tekla.Structures.Model.UI.GraphicsDrawer
The GraphicsDrawer class draws temporary graphics in the currently active rendered view in Tekla Structures.
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
GraphicsDrawer drawer = new GraphicsDrawer();
drawer.DrawText(new Point(0.0, 1000.0, 1000.0), "TEXT SAMPLE", new Color(1.0, 0.5, 0.0));
drawer.DrawLineSegment(new Point(0.0, 0.0, 0.0), new Point(1000.0, 1000.0, 1000.0), new Color(1.0, 0.0, 0.0));
Mesh mesh = new Mesh();
mesh.AddPoint(new Point(   0.0,    0.0, 0.0));
mesh.AddPoint(new Point(1000.0,    0.0, 0.0));
mesh.AddPoint(new Point(1000.0, 1000.0, 0.0));
mesh.AddPoint(new Point(   0.0, 1000.0, 0.0));
mesh.AddTriangle(0,1,2);
mesh.AddTriangle(0,2,3);
mesh.AddLine(0,1); mesh.AddLine(1,2); mesh.AddLine(2,3); mesh.AddLine(3,1);
drawer.DrawMeshSurface(mesh, new Color(1.0, 0.0, 0.0, 0.5));
drawer.DrawMeshLines(mesh, new Color(0.0, 0.0, 1.0));
}
}

Tekla.Structures.Model.UI.GraphicsDrawer.#ctor
Creates a new graphics drawer instance.

Tekla.Structures.Model.UI.GraphicsDrawer.DrawText(Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Model.UI.Color)
Draws a temporary text in the currently active rendered view.
Location: The location of the text's top-left corner.
Text: The text to be drawn. The maximum length is 511 characters.
Color: The color of the text. The transparency value of the color is ignored.
Returns: True on success.

Tekla.Structures.Model.UI.GraphicsDrawer.DrawTextToView(Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Model.UI.Color,Tekla.Structures.Model.UI.View)
Draws a temporary text to the specified view. You can set the view Identifier.ID = 0 for current active view.
Location: The location of the text's top-left corner.
Text: The text to be drawn. The maximum length is 511 characters.
Color: The color of the text. The transparency value of the color is ignored.
View: The model view (ID = 0 for current active view)
Returns: The id of the inserted text.

Tekla.Structures.Model.UI.GraphicsDrawer.DrawLineSegment(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.UI.Color)
Draws a temporary line segment in the currently active rendered view.
LineSegment: The line to draw.
Color: The color of the line. The transparency value of the color is ignored.
Returns: True on success.

Tekla.Structures.Model.UI.GraphicsDrawer.DrawLineSegment(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Model.UI.Color)
Draws a temporary line segment in the currently active rendered view.
Point1: The first point of the line.
Point2: The second point of the line.
Color: The color of the line. The transparency value of the color is ignored.
Returns: True on success.

Tekla.Structures.Model.UI.GraphicsDrawer.DrawMeshSurface(Tekla.Structures.Model.UI.Mesh,Tekla.Structures.Model.UI.Color)
Draws the mesh surface as temporary graphics in the
currently active Tekla Structures rendered view. The counterclockwise sides
of the mesh triangles are drawn.
Mesh: The mesh to draw.
Color: The color of the mesh.
Returns: True on success.

Tekla.Structures.Model.UI.GraphicsDrawer.DrawMeshLines(Tekla.Structures.Model.UI.Mesh,Tekla.Structures.Model.UI.Color)
Draws the mesh lines as temporary graphics in the
currently active Tekla Structures rendered view.
Mesh: The mesh to draw.
Color: The color of the mesh lines. The transparency value of the color is ignored.
Returns: True on success.

Tekla.Structures.Model.UI.GraphicsDrawer.DrawPolyLine(Tekla.Structures.Model.UI.GraphicPolyLine)
Draw a temporary polyline into all open Tekla Structures views.
GraphicPolyLine: The polyline to draw.
Returns: The identifier of the temporary graphic. You can delete the graphic with RemoveTemporaryGraphicsObject.

Tekla.Structures.Model.UI.GraphicsDrawer.RemoveTemporaryGraphicsObject(System.Int32)
Remove a temporary graphic object from all views.
GraphicObjectID: The identifier that was returned when the object was created.

Tekla.Structures.Model.UI.GraphicsDrawer.RemoveTemporaryGraphicsObjects(System.Collections.IEnumerable)
Remove a list of temporary graphic objects from all views.
GraphicObjectIDs: The identifiers that was returned when the object was created.

Tekla.Structures.Model.UI.GraphicsDrawer.Draw(Tekla.Structures.ModelInternal.GraphicObjectContainer)
Draw a graphical object containing lines, polylines, surfaces and textss to all open Tekla Structures views.
graphicObject: The graphical object to draw.
Returns: True in success.

Tekla.Structures.Model.UI.GraphicsDrawer.RemoveGraphicObjectContainer(Tekla.Structures.ModelInternal.GraphicObjectContainer)
Remove a graphic object container from all views.
graphicObject: The object to be removed.

Tekla.Structures.Model.UI.GraphicsDrawer.RemoveGraphicObjectContainers(System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicObjectContainer})
Remove a graphic object container from all views.
graphicObjects: The object to be removed.

Tekla.Structures.Model.UI.GraphicsDrawer.RemoveAllGraphicObjectContainers(System.String)
Removes all graphic object containers in given schema from all views.